In [2]:
import pandas as pd
import numpy as np
data = {'Roll no':[1,2,3,4,5,6,7,8,9,10],
        "Name":["Aditya","Tanish","Rushikesh","Chirag","Om","Samruddhi","Ananya","Snehal","Siddhesh","Devanshi"],
        "Gender":["M","M","M","M","M","F","F","F","M","F"],
        "Marks1":[89,67,90,30,56,70,75,88,87,92],
        "Marks2":[83,63,93,39,28,69,71,90,84,88],
        "Marks3":[95,70,94,65,67,74,36,93,88,90]}
df = pd.DataFrame(data)
sum_column = df["Marks1"]+df["Marks2"]+df["Marks3"]
avg_column = (df["Marks1"]+df["Marks2"]+df["Marks3"])/3
df['Total Marks']=sum_column
df['Avg marks']=avg_column

In [3]:
df

   Roll no       Name Gender  Marks1  Marks2  Marks3  Total Marks  Avg marks
0        1     Aditya      M      89      83      95          267  89.000000
1        2     Tanish      M      67      63      70          200  66.666667
2        3  Rushikesh      M      90      93      94          277  92.333333
3        4     Chirag      M      30      39      65          134  44.666667
4        5         Om      M      56      28      67          151  50.333333
5        6  Samruddhi      F      70      69      74          213  71.000000
6        7     Ananya      F      75      71      36          182  60.666667
7        8     Snehal      F      88      90      93          271  90.333333
8        9   Siddhesh      M      87      84      88          259  86.333333
9       10   Devanshi      F      92      88      90          270  90.000000

In [4]:
varMin=df["Marks1"].min()
print("Lowest marks in Marks1 is ")
varMin

Minimum marks in Marks1 is

30

In [5]:
varMax=df["Marks2"].max()
print("Highest marks in Marks2 is ")
varMax

Maximum marks in Marks2 is

93

In [6]:
varAvg=df["Marks3"].mean()
print("Average in Marks3 is ")
varAvg

Average in Marks3 is

77.2

In [7]:
print("Student with highest average marks")
df.nlargest(1,columns=["Avg marks"])

Student with highest average marks

   Roll no       Name Gender  Marks1  Marks2  Marks3  Total Marks  Avg marks
2        3  Rushikesh      M      90      93      94          277  92.333333

In [8]:
print("Students failed in Marks2")
df["Marks2"]<40

Students who failed the exam

0    False
1    False
2    False
3     True
4     True
5    False
6    False
7    False
8    False
9    False
Name: Marks2, dtype: bool